Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях/РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСтартаТаймера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидСправки</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыОперацийСправкаОВалютныхОперациях</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях/ManagerModule.bsl
Функция ПолучитьИнициализационныеНастройки(ДатаНастроек)
	Макет = ПолучитьМакет("ИнициализационныеНастройки_" + Формат(ДатаНастроек, "ДФ=yyyyMMdd"));
	
	ИнициализационнаяТаблица = Новый ТаблицаЗначений;
	Для Каждого текКолонка Из Метаданные.РегистрыСведений.РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях.Измерения Цикл
		ИнициализационнаяТаблица.Колонки.Добавить(текКолонка.Имя, текКолонка.Тип);
	КонецЦикла;
	Для Каждого текКолонка Из Метаданные.РегистрыСведений.РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях.Ресурсы Цикл
		ИнициализационнаяТаблица.Колонки.Добавить(текКолонка.Имя, текКолонка.Тип);
	КонецЦикла;
	
	Для текСтрока = 2 По Макет.ВысотаТаблицы Цикл
		Если ПустаяСтрока(Макет.Область(текСтрока, 1).Текст) Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ИнициализационнаяТаблица.Добавить();
		НоваяСтрока.ВидСправки = РЭЙ_СлужебныйСервер.ПолучитьКлючСоответствия(РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеСправки(), Макет.Область(текСтрока, 2).Текст);
		НоваяСтрока.НаправлениеПлатежа = РЭЙ_СлужебныйСервер.ПолучитьКлючСоответствия(РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеНаправлениеПлатежа(), Макет.Область(текСтрока, 3).Текст);
		НоваяСтрока.Дни = РЭЙ_СлужебныйСервер.ПолучитьКлючСоответствия(РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеДни(), Макет.Область(текСтрока, 4).Текст);
		НоваяСтрока.КоличествоДней = Число(Макет.Область(текСтрока, 5).Текст);
		НоваяСтрока.ДатаСтартаТаймера = РЭЙ_СлужебныйСервер.ПолучитьКлючСоответствия(РЭЙ_СлужебныйСервер.ПолучитьСоответствиеПредставлениеДатаСтартаТаймера(), Макет.Область(текСтрока, 6).Текст);
	КонецЦикла;
	
	Возврат ИнициализационнаяТаблица;
КонецФункции

Процедура ОчиститьРегистр(Дата) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Период
	|ИЗ
	|	РегистрСведений.РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях КАК Регистр
	|ГДЕ
	|	Регистр.Период >= &Период";
	Запрос.УстановитьПараметр("Период", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьИнициализационныеНастройки() Экспорт
	ДатаНастроек = Дата(2018,03,01);
	
	ОчиститьРегистр(ДатаНастроек);
	
	ИнициализационнаяТаблица = ПолучитьИнициализационныеНастройки(ДатаНастроек);

	НаборЗаписей = РегистрыСведений.РЭЙ_СрокиПредставленияСправкиОВалютныхОперациях.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ДатаНастроек);
	Для Каждого СтрокаТаблицы Из ИнициализационнаяТаблица Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
		Запись.Период = ДатаНастроек;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры
